[{"name":"Francine Marie Sanfilippo","title":"Marriage & Family Therapist","licenses":",","description":"\"My therapeutic approach is client centered, which means we work collaboratively to resolve presenting issues, identify strengths and develop effective coping strategies. I believe in working efficiently, to restore a sense of well being and quality of life. To this end you will experience me as attentive, interactive and responsive to you in sessions. I hold a deep respect for those seeking to engage in therapy; for their courage, vulnerability and commitment to improve their lives. Together we can create a safe and compassionate space for exploration, discovery, understanding and healing.\"","phone":"(415) 521-1864","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/32/01/200132-322271-3_320x400.jpg?pu=1428937549","isVerified":"Verified by Psychology Today"},{"name":"Judith E Siff","title":"Marriage & Family Therapist","licenses":",","description":"\"Peace with ourselves and positive connections with  friends, partners or lovers, families of origin, chosen families or communities, allows us to lead more satisfying lives. Psychotherapy can lead to healing emotions and traumas that block those connections. I provide a safe and compassionate space and support the fullest expression of your true self.  I assist you in identifying and addressing problematic internal messages that impact your current relationships, your work life, your well being.\"","phone":"(415) 423-2943","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/98/42/184298-257444-1_320x400.jpg?pu=1391715740","isVerified":"Verified by Psychology Today"},{"name":"Fawzia Campana","title":"Marriage & Family Therapist","licenses":",","description":"\"If you are experiencing issues related to depression, anxiety, relationship problems, work concerns, if you want to experience a more positive sense of yourself, I can support you in addressing your concerns while learning the skills necessary to create a more fulfilling life.\"","phone":"(510) 480-3344","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/02/42/264202-489821-2_320x400.jpg?pu=1446662029","isVerified":"Verified by Psychology Today"},{"name":"Mariel Barcebal","title":"Psychologist","licenses":",","description":"\"Making the choice to seek support and guidance is very powerful as it means that you are looking to create a shift within yourself, and what you are currently doing is no longer working for you. When we experience life's challenges and transitions, it is so common for us to feel overwhelmed, confused, and very much stuck in the negative cycle of our circumstances.  What I aim to do is work collaboratively with you to create forward movement in your life, and ultimately to create multiple opportunities out of challenge.\"","phone":"(213) 335-2236","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/55/69/266955-1135991-2_320x400.jpg?pu=1519229584","isVerified":"Verified by Psychology Today"},{"name":"Stacey Mcguirl","title":"Marriage & Family Therapist","licenses":",","description":"\"I offer a free first session, because you deserve to find a therapist who is a good match, and meeting face to face can be important.   I work to provide you with real results.                                                                                         Therapy provides a space to speak freely and be heard with care that can provide a person with more internal space for lived experience, emotion, thought and desire. In psychotherapy, you can express your thoughts and feelings and gain insight into the unconscious sources of your conflicts. With warmth and curiosity, I will provide an attentive ear and a thoughtful mind.\"","phone":"(415) 742-2915","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/25/61/96125-861650-2_320x400.jpg?pu=1487464778","isVerified":"Verified by Psychology Today"},{"name":"Jennifer Press","title":"Marriage & Family Therapist","licenses":",","description":"\"I offer individual, couples, and family psychotherapy for adults and adolescents.  My approach is collaborative, warm, and very interactive, lending itself easily to both short term goal oriented work and long term psychotherapy.  My philosophy is that therapy should help my clients gain insight as well as provide useful day to day tools for lasting change.\"","phone":"(510) 379-5952","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/54/80/188054-265759-2_320x400.jpg?pu=1394396649","isVerified":"Verified by Psychology Today"},{"name":"Penny Louise Fellbrich","title":"Marriage & Family Therapist","licenses":",","description":"\"Together we uncover themes woven throughout your life, helping you understand any patterns or beliefs that have been holding you back. With this greater awareness you'll have more choice and freedom to bring your authentic self to the people in your life and to live the life you most desire. I believe that change occurs through altering one's thoughts and actions, so I offer useful tools to support you in living a life that is in alignment with who you truly are. I enjoy working with individuals, couples, and artists.\"","phone":"(415) 795-2605","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/65/97/149765_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Karen Wolfe","title":"Marriage & Family Therapist","licenses":",","description":"\"I am a licensed marriage and family therapist specializing in child and family therapy and social skills groups in San Francisco and the East Bay. I provide play-based child therapy, parenting support (with a focus on Hand in Hand Parenting), social skills groups, and school-based support, including in-class coaching/shadowing. I also provide depth-oriented psychotherapy for adults and offer skills to tackle anxiety, depression, and relationship challenges through EFT/tapping, CBT, mindfulness, and exploring challenges in a safe space.\"","phone":"(415) 692-7910","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/66/21/122166-245796-2_320x400.jpg?pu=1387556877"},{"name":"Ryoko Moriguchi","title":"Marriage & Family Therapist","licenses":",","description":"\"----Eye Movement Desensitization & Reprocessing (EMDR) Therapy Available --- Whether you are looking for help with specific situations, or a place to continue your recovery, having an objective and supportive guide is essential.  Therapy is an invaluable process for anyone who is trying to come to terms with painful experiences, to change patterns that no longer serve you, or to find inner balance in an ever-changing world.\"","phone":"(415) 877-4239","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/39/71/317139-813612-2_320x400.jpg?pu=1483316960","isVerified":"Verified by Psychology Today"},{"name":"Brad Byrum","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I am a relationship therapist. I help couples and families in relationship distress, and individuals struggling with addiction, anxiety, depression, professional stress, grief, chronic illness, aging, and death.  So much of our suffering arises when our relationships aren't working, whether as couples or in our families or in the work place. When we feel disconnected and alone, we can become vulnerable to anxiety, depression and addiction. What we are searching for is a safe place to explore what's not working in our relationships and to find support in creating solutions.\"","phone":"(650) 381-1297","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/20/97/359720-1088016-2_320x400.jpg?pu=1507153456","isVerified":"Verified by Psychology Today"},{"name":"Larry O'Connor, Marriage and Family Therapist","licenses":"MFT,","description":"\"I wonder if you believe your problems can define who you are. Because sometimes I do too. But I also believe what defines us more whether we challenge, and how we meet, them. Problems are  opportunities for recognizing strengths, adding to our toolboxes, to use with current problems, and apply to those in the future.  I strive to be real, active, and collaborative. It's important that I understand you through listening, asking questions, and making sure I'm getting your point of view. I offer assistance, focused attention, professional experience, enthusiasm, encouragement and, where appropriate, humor.\"","phone":"(415) 225-3032","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/47/98/39847-1188540-2_320x400.jpg?pu=1521477600","isVerified":"Verified by Psychology Today"},{"name":"Justin Matthew D'Avella","title":"Psychologist","licenses":",","description":"\"I am a licensed clinical psychologist who works with children, adolescents, adults and couples. My style is warm, inviting and reflective. I utilize an integrative approach to psychotherapy, drawing from psychodynamic, family systems, social justice and mindfulness-based approaches.\"","phone":"(415) 403-2183","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/40/00/270040-518223-3_320x400.jpg?pu=1450979876","isVerified":"Verified by Psychology Today"},{"name":"Shauna Goodenough","title":"Marriage & Family Therapist","licenses":",","description":"\"*I am not accepting new clients at this time* Therapy can be useful in helping individuals cope with stress, and improve relationships with significant others, family members, and self. Therapy can also help your child or teen deal with a loss or trauma that is impacting their relationships or performance in school. Therapy is great for young people who need a space to explore what's going on with feelings or behaviors that they may not know how to deal with on their own.\"","phone":"(415) 702-3685","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/80/60/96080_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Lisa Manca","title":"Counselor","licenses":",","description":"\"Hi there! Are you struggling with feeling down and unable to enjoy activities you love?  Perhaps your self-esteem is low and negative thoughts in your head make it difficult to do even simple tasks.  Your friends and loved ones are concerned and you feel disconnected from yourself, your body, and your life. Or, maybe you worry incessantly about what if scenarios.  Your brain won't turn off--you keep thinking the same thoughts over and over. If these scenarios sound familiar, contact me.  Seeking help is the first step to improve your life and well-being.\"","phone":"(775) 990-1426","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/76/24/172476-437145-2_320x400.jpg?pu=1440447973","isVerified":"Verified by Psychology Today"},{"name":"Winston J. Hendzel","title":"Marriage & Family Therapist","licenses":",","description":"\"I believe that psychotherapy is an interpersonal  journey of discovery of new perspectives and new ideas on the issues that concern the client(s). The therapist lends his or her knowledge of psychotherapeutic techniques, desire to help, ability to empathize, and his or her ideas from past and present experience The client brings curiosity about himself or herself, expertise on his or her own experience, and a desire/need to change.\"","phone":"(415) 873-8045","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/28/22/232228-380681-3_320x400.jpg?pu=1429138223","isVerified":"Verified by Psychology Today"},{"name":"Victoria Julita Spiers","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I am a curious, open-minded, and non-blaming holistic Gestalt who will meet you exactly where you are because I recognize that you are the expert of your own experience. As an empathic witness, advocate, and guide, I will help you increase your self-awareness, self-support, self-acceptance, and sense of agency through mindful observation, personal exploration, and collaborative experimentation. Essentially, I will help you re-examine your life and re-experience yourself and others, in different as well as new meaningful and healing ways. My approach is mindful, intuitive, and tenderhearted.\"","phone":"(628) 888-6233","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/17/31/283117-594242-2_320x400.jpg?pu=1459556092","isVerified":"Verified by Psychology Today"},{"name":"Catherine Singstad, MFT","licenses":"MA,","description":"\"My clients are individuals and couples seeking to find relief and healing from painful circumstances and relationships, and are hoping for more joyful and fulfilling lives.  Most are struggling in their relationships - with partners, friends, family, and work. Exploring your issues in a warm, collaborative manner, you can learn to deeply understand and successfully navigate your emotional world, as we work on the painful symptoms and situations.  Issues I specialize in include difficulties in forming and sustaining healthy intimate relationships, unresolved childhood wounds, couples, anxiety, depression, eating disorders, parenthood, trauma, low self-esteem, recovery from addiction, infertility, loss, and grief.\"","phone":"(415) 255-4117","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/90/07/60790_4_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Akhila E. A. Kolesar","title":"Psychologist","licenses":",","description":"\"I believe that a wellness model truly supports the whole person: the physical, emotional, mental, and spiritual self in each of us. This informs my work with individuals, couples, and family networks by making psychotherapy a meaningful journey in which we find how your unique abilities and strengths can be applied to challenging life situations, relationships, and the unfolding of new ways of being.\"","phone":"(415) 992-9750","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/71/56/155671_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Andrew G Law","title":"Marriage & Family Therapist","licenses":",","description":"\"Counseling and therapy with me is friendly, casual, curious, and engaged.  Down to Earth.  Jargon free.  I will meet you right where you are.  I'm here to help as you gather the courage to change what you can and find the grace to accept what you can't.  I have spent my entire adult life exploring the different sub-cultures of the Bay Area.  So I find that I am quite good at working with men who don't quite fit inside the box.  I especially want to hear from you if you've never considered therapy before.\"","phone":"(510) 491-0709","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/90/99/279990-577181-2_320x400.jpg?pu=1457635470","isVerified":"Verified by Psychology Today"},{"name":"Lori Kandels","title":"Marriage & Family Therapist","licenses":",","description":"\"You're probably here because something isn't working in your life. Maybe you know what it is, maybe you don't. Maybe things are going really well, but you feel like you're standing outside and looking in at your life. Or maybe things aren't going well, and you don't know how to get your life on track.\"","phone":"(415) 340-7089","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/35/26/362635-1108464-2_320x400.jpg?pu=1508797921","isVerified":"Verified by Psychology Today"}]