[{"name":"Francine Marie Sanfilippo","title":"Marriage & Family Therapist","licenses":",","description":"\"My therapeutic approach is client centered, which means we work collaboratively to resolve presenting issues, identify strengths and develop effective coping strategies. I believe in working efficiently, to restore a sense of well being and quality of life. To this end you will experience me as attentive, interactive and responsive to you in sessions. I hold a deep respect for those seeking to engage in therapy; for their courage, vulnerability and commitment to improve their lives. Together we can create a safe and compassionate space for exploration, discovery, understanding and healing.\"","phone":"(415) 521-1864","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/32/01/200132-322271-3_320x400.jpg?pu=1428937549","isVerified":"Verified by Psychology Today"},{"name":"Judith E Siff","title":"Marriage & Family Therapist","licenses":",","description":"\"Peace with ourselves and positive connections with  friends, partners or lovers, families of origin, chosen families or communities, allows us to lead more satisfying lives. Psychotherapy can lead to healing emotions and traumas that block those connections. I provide a safe and compassionate space and support the fullest expression of your true self.  I assist you in identifying and addressing problematic internal messages that impact your current relationships, your work life, your well being.\"","phone":"(415) 423-2943","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/98/42/184298-257444-1_320x400.jpg?pu=1391715740","isVerified":"Verified by Psychology Today"},{"name":"Fawzia Campana","title":"Marriage & Family Therapist","licenses":",","description":"\"If you are experiencing issues related to depression, anxiety, relationship problems, work concerns, if you want to experience a more positive sense of yourself, I can support you in addressing your concerns while learning the skills necessary to create a more fulfilling life.\"","phone":"(510) 480-3344","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/02/42/264202-489821-2_320x400.jpg?pu=1446662029","isVerified":"Verified by Psychology Today"},{"name":"Mariel Barcebal","title":"Psychologist","licenses":",","description":"\"Making the choice to seek support and guidance is very powerful as it means that you are looking to create a shift within yourself, and what you are currently doing is no longer working for you. When we experience life's challenges and transitions, it is so common for us to feel overwhelmed, confused, and very much stuck in the negative cycle of our circumstances.  What I aim to do is work collaboratively with you to create forward movement in your life, and ultimately to create multiple opportunities out of challenge.\"","phone":"(213) 335-2236","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/55/69/266955-1135991-2_320x400.jpg?pu=1519229584","isVerified":"Verified by Psychology Today"},{"name":"Stacey Mcguirl","title":"Marriage & Family Therapist","licenses":",","description":"\"I offer a free first session, because you deserve to find a therapist who is a good match, and meeting face to face can be important.   I work to provide you with real results.                                                                                         Therapy provides a space to speak freely and be heard with care that can provide a person with more internal space for lived experience, emotion, thought and desire. In psychotherapy, you can express your thoughts and feelings and gain insight into the unconscious sources of your conflicts. With warmth and curiosity, I will provide an attentive ear and a thoughtful mind.\"","phone":"(415) 742-2915","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/25/61/96125-861650-2_320x400.jpg?pu=1487464778","isVerified":"Verified by Psychology Today"},{"name":"Jennifer Press","title":"Marriage & Family Therapist","licenses":",","description":"\"I offer individual, couples, and family psychotherapy for adults and adolescents.  My approach is collaborative, warm, and very interactive, lending itself easily to both short term goal oriented work and long term psychotherapy.  My philosophy is that therapy should help my clients gain insight as well as provide useful day to day tools for lasting change.\"","phone":"(510) 379-5952","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/54/80/188054-265759-2_320x400.jpg?pu=1394396649","isVerified":"Verified by Psychology Today"},{"name":"Penny Louise Fellbrich","title":"Marriage & Family Therapist","licenses":",","description":"\"Together we uncover themes woven throughout your life, helping you understand any patterns or beliefs that have been holding you back. With this greater awareness you'll have more choice and freedom to bring your authentic self to the people in your life and to live the life you most desire. I believe that change occurs through altering one's thoughts and actions, so I offer useful tools to support you in living a life that is in alignment with who you truly are. I enjoy working with individuals, couples, and artists.\"","phone":"(415) 795-2605","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/65/97/149765_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Karen Wolfe","title":"Marriage & Family Therapist","licenses":",","description":"\"I am a licensed marriage and family therapist specializing in child and family therapy and social skills groups in San Francisco and the East Bay. I provide play-based child therapy, parenting support (with a focus on Hand in Hand Parenting), social skills groups, and school-based support, including in-class coaching/shadowing. I also provide depth-oriented psychotherapy for adults and offer skills to tackle anxiety, depression, and relationship challenges through EFT/tapping, CBT, mindfulness, and exploring challenges in a safe space.\"","phone":"(415) 692-7910","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/66/21/122166-245796-2_320x400.jpg?pu=1387556877"},{"name":"Ryoko Moriguchi","title":"Marriage & Family Therapist","licenses":",","description":"\"----Eye Movement Desensitization & Reprocessing (EMDR) Therapy Available --- Whether you are looking for help with specific situations, or a place to continue your recovery, having an objective and supportive guide is essential.  Therapy is an invaluable process for anyone who is trying to come to terms with painful experiences, to change patterns that no longer serve you, or to find inner balance in an ever-changing world.\"","phone":"(415) 877-4239","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/39/71/317139-813612-2_320x400.jpg?pu=1483316960","isVerified":"Verified by Psychology Today"},{"name":"Brad Byrum","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I am a relationship therapist. I help couples and families in relationship distress, and individuals struggling with addiction, anxiety, depression, professional stress, grief, chronic illness, aging, and death.  So much of our suffering arises when our relationships aren't working, whether as couples or in our families or in the work place. When we feel disconnected and alone, we can become vulnerable to anxiety, depression and addiction. What we are searching for is a safe place to explore what's not working in our relationships and to find support in creating solutions.\"","phone":"(650) 381-1297","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/20/97/359720-1088016-2_320x400.jpg?pu=1507153456","isVerified":"Verified by Psychology Today"},{"name":"Larry O'Connor, Marriage and Family Therapist","licenses":"MFT,","description":"\"I wonder if you believe your problems can define who you are. Because sometimes I do too. But I also believe what defines us more whether we challenge, and how we meet, them. Problems are  opportunities for recognizing strengths, adding to our toolboxes, to use with current problems, and apply to those in the future.  I strive to be real, active, and collaborative. It's important that I understand you through listening, asking questions, and making sure I'm getting your point of view. I offer assistance, focused attention, professional experience, enthusiasm, encouragement and, where appropriate, humor.\"","phone":"(415) 225-3032","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/47/98/39847-1188540-2_320x400.jpg?pu=1521477600","isVerified":"Verified by Psychology Today"},{"name":"Justin Matthew D'Avella","title":"Psychologist","licenses":",","description":"\"I am a licensed clinical psychologist who works with children, adolescents, adults and couples. My style is warm, inviting and reflective. I utilize an integrative approach to psychotherapy, drawing from psychodynamic, family systems, social justice and mindfulness-based approaches.\"","phone":"(415) 403-2183","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/40/00/270040-518223-3_320x400.jpg?pu=1450979876","isVerified":"Verified by Psychology Today"},{"name":"Shauna Goodenough","title":"Marriage & Family Therapist","licenses":",","description":"\"*I am not accepting new clients at this time* Therapy can be useful in helping individuals cope with stress, and improve relationships with significant others, family members, and self. Therapy can also help your child or teen deal with a loss or trauma that is impacting their relationships or performance in school. Therapy is great for young people who need a space to explore what's going on with feelings or behaviors that they may not know how to deal with on their own.\"","phone":"(415) 702-3685","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/80/60/96080_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Lisa Manca","title":"Counselor","licenses":",","description":"\"Hi there! Are you struggling with feeling down and unable to enjoy activities you love?  Perhaps your self-esteem is low and negative thoughts in your head make it difficult to do even simple tasks.  Your friends and loved ones are concerned and you feel disconnected from yourself, your body, and your life. Or, maybe you worry incessantly about what if scenarios.  Your brain won't turn off--you keep thinking the same thoughts over and over. If these scenarios sound familiar, contact me.  Seeking help is the first step to improve your life and well-being.\"","phone":"(775) 990-1426","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/76/24/172476-437145-2_320x400.jpg?pu=1440447973","isVerified":"Verified by Psychology Today"},{"name":"Winston J. Hendzel","title":"Marriage & Family Therapist","licenses":",","description":"\"I believe that psychotherapy is an interpersonal  journey of discovery of new perspectives and new ideas on the issues that concern the client(s). The therapist lends his or her knowledge of psychotherapeutic techniques, desire to help, ability to empathize, and his or her ideas from past and present experience The client brings curiosity about himself or herself, expertise on his or her own experience, and a desire/need to change.\"","phone":"(415) 873-8045","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/28/22/232228-380681-3_320x400.jpg?pu=1429138223","isVerified":"Verified by Psychology Today"},{"name":"Victoria Julita Spiers","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I am a curious, open-minded, and non-blaming holistic Gestalt who will meet you exactly where you are because I recognize that you are the expert of your own experience. As an empathic witness, advocate, and guide, I will help you increase your self-awareness, self-support, self-acceptance, and sense of agency through mindful observation, personal exploration, and collaborative experimentation. Essentially, I will help you re-examine your life and re-experience yourself and others, in different as well as new meaningful and healing ways. My approach is mindful, intuitive, and tenderhearted.\"","phone":"(628) 888-6233","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/17/31/283117-594242-2_320x400.jpg?pu=1459556092","isVerified":"Verified by Psychology Today"},{"name":"Catherine Singstad, MFT","licenses":"MA,","description":"\"My clients are individuals and couples seeking to find relief and healing from painful circumstances and relationships, and are hoping for more joyful and fulfilling lives.  Most are struggling in their relationships - with partners, friends, family, and work. Exploring your issues in a warm, collaborative manner, you can learn to deeply understand and successfully navigate your emotional world, as we work on the painful symptoms and situations.  Issues I specialize in include difficulties in forming and sustaining healthy intimate relationships, unresolved childhood wounds, couples, anxiety, depression, eating disorders, parenthood, trauma, low self-esteem, recovery from addiction, infertility, loss, and grief.\"","phone":"(415) 255-4117","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/90/07/60790_4_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Akhila E. A. Kolesar","title":"Psychologist","licenses":",","description":"\"I believe that a wellness model truly supports the whole person: the physical, emotional, mental, and spiritual self in each of us. This informs my work with individuals, couples, and family networks by making psychotherapy a meaningful journey in which we find how your unique abilities and strengths can be applied to challenging life situations, relationships, and the unfolding of new ways of being.\"","phone":"(415) 992-9750","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/71/56/155671_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Andrew G Law","title":"Marriage & Family Therapist","licenses":",","description":"\"Counseling and therapy with me is friendly, casual, curious, and engaged.  Down to Earth.  Jargon free.  I will meet you right where you are.  I'm here to help as you gather the courage to change what you can and find the grace to accept what you can't.  I have spent my entire adult life exploring the different sub-cultures of the Bay Area.  So I find that I am quite good at working with men who don't quite fit inside the box.  I especially want to hear from you if you've never considered therapy before.\"","phone":"(510) 491-0709","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/90/99/279990-577181-2_320x400.jpg?pu=1457635470","isVerified":"Verified by Psychology Today"},{"name":"Lori Kandels","title":"Marriage & Family Therapist","licenses":",","description":"\"You're probably here because something isn't working in your life. Maybe you know what it is, maybe you don't. Maybe things are going really well, but you feel like you're standing outside and looking in at your life. Or maybe things aren't going well, and you don't know how to get your life on track.\"","phone":"(415) 340-7089","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/35/26/362635-1108464-2_320x400.jpg?pu=1508797921","isVerified":"Verified by Psychology Today"},{"name":"Jessica Hegedus","title":"Psychologist","licenses":",","description":"\"I can help you make changes in your life.  I work with adults, couples, families and children to address stress, emotion and identity. I provide a nonjudgmental, safe and supportive space for you to explore stuck and challenging relationships, alter unproductive thoughts and behavior patterns, and navigate transitions in your life. While therapy doesn't have all the answers, working together on some of these issues can help you to feel more empowered.   I enjoy working with LGBTQ families, those who identify as polyamorous, and women of all shapes and sizes.\"","phone":"(415) 914-8923","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/54/16/111654_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Holly Oswald","title":"Psychologist","licenses":",","description":"\"I offer individual and family therapy for adults and adolescents, couples therapy, play therapy for children, and psychological testing for all ages. Using a mixture of cognitive, expressive, and reflective approaches, I help clients address a wide range of issues including anxiety, depression, grief, managing life transitions, behavioral problems, and relationship conflicts.  I have specialized experience helping clients with histories of trauma, neglect, and abuse, as well as those who have been diagnosed with chronic illnesses and pain disorders.\"","phone":"(415) 969-2073","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/11/60/266011-1141543-2_320x400.jpg?pu=1515034678","isVerified":"Verified by Psychology Today"},{"name":"Daniella Beznicki","title":"Marriage & Family Therapist","licenses":",","description":"\"Therapy can lead to better relationships and more ease in our lives.  I work with people to get in touch with the most authentic and real parts of themselves. Sometimes these parts get buried because of how we've felt hurt or misunderstood in life. Together we will get to know these hurt parts and how they show up, whether it is through fears and worries, the critical voice you hear inside, or a feeling of being stuck, lost, alone or helpless.\"","phone":"(415) 255-2650","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/14/28/202814-673420-3_320x400.jpg?pu=1468852223","isVerified":"Verified by Psychology Today"},{"name":"Donna Molettiere, Somatic Psychotherapy","licenses":"MA,","description":"\"I offer a safe, warm and clear environment where sensitive issues can be explored and tangible tools implemented for making positive changes.  Maybe you are experiencing challenges in relationships at home or at work, or you are holding yourself back based on issues from your family of origin.  Maybe you suffer from depression, anxiety, stress or you have yet to tap into what your heart truly desires with a sense of purpose and passion. I will help you discover new resources within yourself so you are empowered to live with more vitality and satisfaction in life.\"","phone":"(415) 390-2486","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/99/33/123399-1157304-2_320x400.jpg?pu=1517236833","isVerified":"Verified by Psychology Today"},{"name":"Judith Rubin LCSW","licenses":"LCSW","description":"\"I am a seasoned psychotherapist. My work is depth oriented and solution focused. Often grief prevents reaching for support.  A heart centered approach can allow the unfreezing and softening that makes therapy accessible. Regardless of the pain you are struggling through, meeting and talking together can determine weither we are a good fit. Contact me for a free consultation. We can trust our process, to find a direction forward.\"","phone":"(415) 915-6743","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/08/49/394908-1231936-2_320x400.jpg?pu=1527035860","isVerified":"Verified by Psychology Today"},{"name":"Leticia A Manzanares","title":"Marriage & Family Therapist","licenses":",","description":"\"Relationships are challenging and they bring a spectrum of emotions from happiness to heartache. Having a quiet place to deal with the adjustment of any major life transition can bring an experience of change and insight.  My goal is to create a safe, confidential and supported space for my client to do the necessary interpersonal work so they can bring the best of themselves to any relationship or life issue. I take a client-centered approach, which gives me the opportunity to invite the client to explore the process of personal growth.\"","phone":"(415) 697-3362","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/23/57/135723_6_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Dan Scharlack","title":"Marriage & Family Therapist","licenses":",","description":"\"What is it you most deeply want? I can help you find your natural strengths and let go of old beliefs and painful emotions that stand in the way of you loving the life you live.   Through a mindful and compassionate inquiry into places where you feel stuck, I help you to extinguish negative patterns and to recognize and express your true gifts in the world.  Many of my clients are artists and creative professionals. My specialties include helping you to have more fulfilling relationships, expand your creativity, overcome addictive patterns, develop your self-esteem, and experience greater personal growth.\"","phone":"(415) 704-8638","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/87/88/108887_7_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Vera Fleischer","title":"Marriage & Family Therapist","licenses":",","description":"\"As a psychotherapist working with shame, self-esteem and the inner critic, I like to focus more on making use of your choices when you uncover that you are already good enough and less on healing your so-called broken parts. I propose that being comfortable in your own skin, whether you are alone or with others, is more helpful than attaining a particular self-image.\"","phone":"(415) 723-1443","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/36/65/256536-893564-2_320x400.jpg?pu=1490298656","isVerified":"Verified by Psychology Today"},{"name":"Lily (Christian) Eggers","title":"Marriage & Family Therapist","licenses":",","description":"\"Please note that I'll be on Maternity leave July, 2017 - Spring, 2018.  Please reach out if you'd like to be contacted when I return. I have spent over 20 years exploring my own mind/body connection and personal potential through yoga, meditation, hypnosis, triathlon training, rock climbing, cycling, and fire walking. I created Yin Warrior Health, a program designed to heal our relationship with food and body image, and BodyAwake, a unique holistic fitness which heightens physical/emotional sensitivity.  I work best with people burdened with ineffectual patterns who know there is more to life than staying stuck!\"","phone":"(415) 767-1741","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/49/55/135549_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Lu Peyre","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"My role as a therapist is that of an empathetic co-pilot.  I work in a client-centered way,  and I will support you in creating healthy choices and new resources for yourself. My approach is compassionate, intuitive, and interactive.  I strive to meet each client's personality and goals in a safe and welcoming environment.  I am multilingual and multicultural. My various life experiences provide a base that will help me support you as we work together to meet your goals.\"","phone":"(415) 857-0013","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/64/67/296764-718030-2_320x400.jpg?pu=1472942426","isVerified":"Verified by Psychology Today"},{"name":"Rhea St. Julien","title":"Marriage & Family Therapist","licenses":",","description":"\"Please note: I am currently on Maternity Leave. Please contact me in September! You do not need to be perfect. You do not need to be alone with your imperfections. Whether you are a stressed out parent trying to \"have it all\", a couple that wants more than to look happy on Facebook, or an individual struggling with who you are supposed to be in this world, I can help you navigate your life in an empowering way. In a session with me, we will use the arts and creativity to go further than words, to create real, deep change.\"","phone":"(415) 858-6773","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/14/95/59514-333322-2_320x400.jpg?pu=1415905892","isVerified":"Verified by Psychology Today"},{"name":"Cheryl Leong","title":"Marriage & Family Therapist","licenses":",","description":"\"If you're looking for a balance of depth, empathy and pragmatism you may book an appointment for a complimentary phone consult here: http://cherylleonglmft.fullslate.com\"","phone":"(415) 598-4265","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/12/91/89112-686498-3_320x400.jpg?pu=1501105293","isVerified":"Verified by Psychology Today"},{"name":"Alexandra (Ali) Joy Sideroff","title":"Marriage & Family Therapist","licenses":",","description":"\"I support clients of diverse cultural backgrounds and ages in working through judgments so they can accept themselves and live with trust rather than shame and doubt. We may work through past traumas that have shaped the self or examine present issues from a solution-focused perspective to develop tools that can be applied to daily life.\"","phone":"(415) 799-8168","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/37/42/94237-1034042-2_320x400.jpg?pu=1503291664","isVerified":"Verified by Psychology Today"},{"name":"Marika Davis","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I'm curious about people: how our unique histories have shaped us, how we relate to each other, and what motivates our behavior. Working together, we have an opportunity to co-create a relationship that feels comfortable and supportive. I offer reflection and inquiry to help strengthen your ability to identify emotions, sensations, behavioral patterns and your truth. This awareness often connects to past experiences, further developing an understanding of yourself and your needs.\"","phone":"(415) 943-2389","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/05/45/364505-1115091-2_320x400.jpg?pu=1509857479","isVerified":"Verified by Psychology Today"},{"name":"Theresa Lucia Cangelosi","title":"Marriage & Family Therapist","licenses":",","description":"\"I treat individuals and couples of all ages.  As a somatic psychotherapist, I use a body-mind approach to help clients move through life's challenges in a natural, integrative and holistic way.  I specialize in education, prevention and resolution of trauma. At times we can feel stuck and confused, and need help coming back into balance in our bodies, minds and relationships.  A somatic approach focuses on the here and now and what is going on.  It is only when we are aware of what we are sensing in the present that we can make a boundary or choice.\"","phone":"(415) 236-2912","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/12/22/122212_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Jami Grich","title":"Psychologist","licenses":",","description":"\"Find Your Joy is the name of my practice and sums up what I believe the goal of therapy is. If you are searching for your joy, I can probably help you. Many people lost their joy (or never had it) due to anxiety, depression, stress, relationship problems, loneliness, emptiness, fear, trauma, chronic pain, addiction...or a combination of these things. My belief is that deep healing creates the space for love to enter and joy to return. I have 20 years of training in mind, body, spirit techniques to help you understand and overcome your problems & find your joy.\"","phone":"(415) 625-0045","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/51/03/190351-288604-3_320x400.jpg?pu=1401975361","isVerified":"Verified by Psychology Today"},{"name":"Vanessa Wolter","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I specialize in holistically treating social anxiety, sensitivity, relationship issues, low self-esteem, negative body image, panic, grief, depression, trauma, and existential/spiritual crisis. My mission is to help clients transform their pain into an opportunity for self-discovery, healing and empowerment, to ultimately reclaim their voice, purpose, and self-worth. I compassionately welcome individuals who feel silenced, disconnected from loved ones, overwhelmed, lost, or that they \"don't belong,\" as well as people who have experienced bullying, emotional or physical abuse, and those who don't feel comfortable in their body or struggle with a harsh inner critic.\"","phone":"(415) 237-9513","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/51/91/299151-795714-2_320x400.jpg?pu=1480949297","isVerified":"Verified by Psychology Today"},{"name":"Sally Payson Hays","title":"Psychologist","licenses":",","description":"\"My specialty is in helping support children and adolescents who struggle in school with learning differences and ADHD.  I provide thorough assessment as well as ongoing advocacy with public and private schools as well as individual therapy and family support to children, teens, and young adults.  I also provide education and information to groups of parents and educators who want to be more effective in supporting children succeed.  I use CBT and mindfulness practice to help children and parents communicate more succesfully, and to promote problem solving while improving relationships.  I provide assessment and advocacy packages to minimize costs.\"","phone":"(415) 704-8252","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/62/01/150162-468064-2_320x400.jpg?pu=1444080519","isVerified":"Verified by Psychology Today"},{"name":"Sebastian Melo","title":"Clinical Social Work/Therapist","licenses":",","description":"\"When facing life stressors and during difficult transitions, it is good to know that there are safe places where you can turn to for support and guidance. I am a bilingual (Spanish/English) licensed clinical social worker in San Francisco and have experience providing therapy with clients from diverse cultures.  Sexual orientations and gender identity have been a focus for some of my work. I believe that therapy is a useful tool to help you manage your life better and to build skills to reduce anxiety and depression, and to cultivate self-compassion.\"","phone":"(650) 620-7798","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/13/15/361513-1100810-3_320x400.jpg?pu=1508252874","isVerified":"Verified by Psychology Today"},{"name":"Jo Sopko","title":"Marriage & Family Therapist","licenses":",","description":"\"* ADULTS: I work with issues of loss, stress, anxiety,  depression, abuse, sex addiction, spiritual guidance, and developmental life changes.* CHILDREN:  I invite their stories that may be troubled due to emotional and academic issues. Through play, art and sand tray, I address issues of divorce, traumatic losses, abuse, adoption, bullying and low self esteem that may be affecting your children.                 * COUPLES: My passion is to help the couple find a yet unknown way to a compassionate, loving, open communicative relationship; to become vulnerable to the pain and wounds of each other's soul.\"","phone":"(415) 799-4143","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/45/51/135145_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"}]