[{"name":"Francine Marie Sanfilippo","title":"Marriage & Family Therapist","licenses":",","description":"\"My therapeutic approach is client centered, which means we work collaboratively to resolve presenting issues, identify strengths and develop effective coping strategies. I believe in working efficiently, to restore a sense of well being and quality of life. To this end you will experience me as attentive, interactive and responsive to you in sessions. I hold a deep respect for those seeking to engage in therapy; for their courage, vulnerability and commitment to improve their lives. Together we can create a safe and compassionate space for exploration, discovery, understanding and healing.\"","phone":"(415) 521-1864","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/32/01/200132-322271-3_320x400.jpg?pu=1428937549","isVerified":"Verified by Psychology Today"},{"name":"Judith E Siff","title":"Marriage & Family Therapist","licenses":",","description":"\"Peace with ourselves and positive connections with  friends, partners or lovers, families of origin, chosen families or communities, allows us to lead more satisfying lives. Psychotherapy can lead to healing emotions and traumas that block those connections. I provide a safe and compassionate space and support the fullest expression of your true self.  I assist you in identifying and addressing problematic internal messages that impact your current relationships, your work life, your well being.\"","phone":"(415) 423-2943","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/98/42/184298-257444-1_320x400.jpg?pu=1391715740","isVerified":"Verified by Psychology Today"},{"name":"Fawzia Campana","title":"Marriage & Family Therapist","licenses":",","description":"\"If you are experiencing issues related to depression, anxiety, relationship problems, work concerns, if you want to experience a more positive sense of yourself, I can support you in addressing your concerns while learning the skills necessary to create a more fulfilling life.\"","phone":"(510) 480-3344","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/02/42/264202-489821-2_320x400.jpg?pu=1446662029","isVerified":"Verified by Psychology Today"},{"name":"Mariel Barcebal","title":"Psychologist","licenses":",","description":"\"Making the choice to seek support and guidance is very powerful as it means that you are looking to create a shift within yourself, and what you are currently doing is no longer working for you. When we experience life's challenges and transitions, it is so common for us to feel overwhelmed, confused, and very much stuck in the negative cycle of our circumstances.  What I aim to do is work collaboratively with you to create forward movement in your life, and ultimately to create multiple opportunities out of challenge.\"","phone":"(213) 335-2236","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/55/69/266955-1135991-2_320x400.jpg?pu=1519229584","isVerified":"Verified by Psychology Today"},{"name":"Stacey Mcguirl","title":"Marriage & Family Therapist","licenses":",","description":"\"I offer a free first session, because you deserve to find a therapist who is a good match, and meeting face to face can be important.   I work to provide you with real results.                                                                                         Therapy provides a space to speak freely and be heard with care that can provide a person with more internal space for lived experience, emotion, thought and desire. In psychotherapy, you can express your thoughts and feelings and gain insight into the unconscious sources of your conflicts. With warmth and curiosity, I will provide an attentive ear and a thoughtful mind.\"","phone":"(415) 742-2915","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/25/61/96125-861650-2_320x400.jpg?pu=1487464778","isVerified":"Verified by Psychology Today"},{"name":"Jennifer Press","title":"Marriage & Family Therapist","licenses":",","description":"\"I offer individual, couples, and family psychotherapy for adults and adolescents.  My approach is collaborative, warm, and very interactive, lending itself easily to both short term goal oriented work and long term psychotherapy.  My philosophy is that therapy should help my clients gain insight as well as provide useful day to day tools for lasting change.\"","phone":"(510) 379-5952","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/54/80/188054-265759-2_320x400.jpg?pu=1394396649","isVerified":"Verified by Psychology Today"},{"name":"Penny Louise Fellbrich","title":"Marriage & Family Therapist","licenses":",","description":"\"Together we uncover themes woven throughout your life, helping you understand any patterns or beliefs that have been holding you back. With this greater awareness you'll have more choice and freedom to bring your authentic self to the people in your life and to live the life you most desire. I believe that change occurs through altering one's thoughts and actions, so I offer useful tools to support you in living a life that is in alignment with who you truly are. I enjoy working with individuals, couples, and artists.\"","phone":"(415) 795-2605","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/65/97/149765_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Karen Wolfe","title":"Marriage & Family Therapist","licenses":",","description":"\"I am a licensed marriage and family therapist specializing in child and family therapy and social skills groups in San Francisco and the East Bay. I provide play-based child therapy, parenting support (with a focus on Hand in Hand Parenting), social skills groups, and school-based support, including in-class coaching/shadowing. I also provide depth-oriented psychotherapy for adults and offer skills to tackle anxiety, depression, and relationship challenges through EFT/tapping, CBT, mindfulness, and exploring challenges in a safe space.\"","phone":"(415) 692-7910","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/66/21/122166-245796-2_320x400.jpg?pu=1387556877"},{"name":"Ryoko Moriguchi","title":"Marriage & Family Therapist","licenses":",","description":"\"----Eye Movement Desensitization & Reprocessing (EMDR) Therapy Available --- Whether you are looking for help with specific situations, or a place to continue your recovery, having an objective and supportive guide is essential.  Therapy is an invaluable process for anyone who is trying to come to terms with painful experiences, to change patterns that no longer serve you, or to find inner balance in an ever-changing world.\"","phone":"(415) 877-4239","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/39/71/317139-813612-2_320x400.jpg?pu=1483316960","isVerified":"Verified by Psychology Today"},{"name":"Brad Byrum","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I am a relationship therapist. I help couples and families in relationship distress, and individuals struggling with addiction, anxiety, depression, professional stress, grief, chronic illness, aging, and death.  So much of our suffering arises when our relationships aren't working, whether as couples or in our families or in the work place. When we feel disconnected and alone, we can become vulnerable to anxiety, depression and addiction. What we are searching for is a safe place to explore what's not working in our relationships and to find support in creating solutions.\"","phone":"(650) 381-1297","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/20/97/359720-1088016-2_320x400.jpg?pu=1507153456","isVerified":"Verified by Psychology Today"},{"name":"Larry O'Connor, Marriage and Family Therapist","licenses":"MFT,","description":"\"I wonder if you believe your problems can define who you are. Because sometimes I do too. But I also believe what defines us more whether we challenge, and how we meet, them. Problems are  opportunities for recognizing strengths, adding to our toolboxes, to use with current problems, and apply to those in the future.  I strive to be real, active, and collaborative. It's important that I understand you through listening, asking questions, and making sure I'm getting your point of view. I offer assistance, focused attention, professional experience, enthusiasm, encouragement and, where appropriate, humor.\"","phone":"(415) 225-3032","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/47/98/39847-1188540-2_320x400.jpg?pu=1521477600","isVerified":"Verified by Psychology Today"},{"name":"Justin Matthew D'Avella","title":"Psychologist","licenses":",","description":"\"I am a licensed clinical psychologist who works with children, adolescents, adults and couples. My style is warm, inviting and reflective. I utilize an integrative approach to psychotherapy, drawing from psychodynamic, family systems, social justice and mindfulness-based approaches.\"","phone":"(415) 403-2183","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/40/00/270040-518223-3_320x400.jpg?pu=1450979876","isVerified":"Verified by Psychology Today"},{"name":"Shauna Goodenough","title":"Marriage & Family Therapist","licenses":",","description":"\"*I am not accepting new clients at this time* Therapy can be useful in helping individuals cope with stress, and improve relationships with significant others, family members, and self. Therapy can also help your child or teen deal with a loss or trauma that is impacting their relationships or performance in school. Therapy is great for young people who need a space to explore what's going on with feelings or behaviors that they may not know how to deal with on their own.\"","phone":"(415) 702-3685","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/80/60/96080_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Lisa Manca","title":"Counselor","licenses":",","description":"\"Hi there! Are you struggling with feeling down and unable to enjoy activities you love?  Perhaps your self-esteem is low and negative thoughts in your head make it difficult to do even simple tasks.  Your friends and loved ones are concerned and you feel disconnected from yourself, your body, and your life. Or, maybe you worry incessantly about what if scenarios.  Your brain won't turn off--you keep thinking the same thoughts over and over. If these scenarios sound familiar, contact me.  Seeking help is the first step to improve your life and well-being.\"","phone":"(775) 990-1426","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/76/24/172476-437145-2_320x400.jpg?pu=1440447973","isVerified":"Verified by Psychology Today"},{"name":"Winston J. Hendzel","title":"Marriage & Family Therapist","licenses":",","description":"\"I believe that psychotherapy is an interpersonal  journey of discovery of new perspectives and new ideas on the issues that concern the client(s). The therapist lends his or her knowledge of psychotherapeutic techniques, desire to help, ability to empathize, and his or her ideas from past and present experience The client brings curiosity about himself or herself, expertise on his or her own experience, and a desire/need to change.\"","phone":"(415) 873-8045","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/28/22/232228-380681-3_320x400.jpg?pu=1429138223","isVerified":"Verified by Psychology Today"},{"name":"Victoria Julita Spiers","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I am a curious, open-minded, and non-blaming holistic Gestalt who will meet you exactly where you are because I recognize that you are the expert of your own experience. As an empathic witness, advocate, and guide, I will help you increase your self-awareness, self-support, self-acceptance, and sense of agency through mindful observation, personal exploration, and collaborative experimentation. Essentially, I will help you re-examine your life and re-experience yourself and others, in different as well as new meaningful and healing ways. My approach is mindful, intuitive, and tenderhearted.\"","phone":"(628) 888-6233","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/17/31/283117-594242-2_320x400.jpg?pu=1459556092","isVerified":"Verified by Psychology Today"},{"name":"Catherine Singstad, MFT","licenses":"MA,","description":"\"My clients are individuals and couples seeking to find relief and healing from painful circumstances and relationships, and are hoping for more joyful and fulfilling lives.  Most are struggling in their relationships - with partners, friends, family, and work. Exploring your issues in a warm, collaborative manner, you can learn to deeply understand and successfully navigate your emotional world, as we work on the painful symptoms and situations.  Issues I specialize in include difficulties in forming and sustaining healthy intimate relationships, unresolved childhood wounds, couples, anxiety, depression, eating disorders, parenthood, trauma, low self-esteem, recovery from addiction, infertility, loss, and grief.\"","phone":"(415) 255-4117","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/90/07/60790_4_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Akhila E. A. Kolesar","title":"Psychologist","licenses":",","description":"\"I believe that a wellness model truly supports the whole person: the physical, emotional, mental, and spiritual self in each of us. This informs my work with individuals, couples, and family networks by making psychotherapy a meaningful journey in which we find how your unique abilities and strengths can be applied to challenging life situations, relationships, and the unfolding of new ways of being.\"","phone":"(415) 992-9750","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/71/56/155671_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Andrew G Law","title":"Marriage & Family Therapist","licenses":",","description":"\"Counseling and therapy with me is friendly, casual, curious, and engaged.  Down to Earth.  Jargon free.  I will meet you right where you are.  I'm here to help as you gather the courage to change what you can and find the grace to accept what you can't.  I have spent my entire adult life exploring the different sub-cultures of the Bay Area.  So I find that I am quite good at working with men who don't quite fit inside the box.  I especially want to hear from you if you've never considered therapy before.\"","phone":"(510) 491-0709","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/90/99/279990-577181-2_320x400.jpg?pu=1457635470","isVerified":"Verified by Psychology Today"},{"name":"Lori Kandels","title":"Marriage & Family Therapist","licenses":",","description":"\"You're probably here because something isn't working in your life. Maybe you know what it is, maybe you don't. Maybe things are going really well, but you feel like you're standing outside and looking in at your life. Or maybe things aren't going well, and you don't know how to get your life on track.\"","phone":"(415) 340-7089","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/35/26/362635-1108464-2_320x400.jpg?pu=1508797921","isVerified":"Verified by Psychology Today"},{"name":"Jessica Hegedus","title":"Psychologist","licenses":",","description":"\"I can help you make changes in your life.  I work with adults, couples, families and children to address stress, emotion and identity. I provide a nonjudgmental, safe and supportive space for you to explore stuck and challenging relationships, alter unproductive thoughts and behavior patterns, and navigate transitions in your life. While therapy doesn't have all the answers, working together on some of these issues can help you to feel more empowered.   I enjoy working with LGBTQ families, those who identify as polyamorous, and women of all shapes and sizes.\"","phone":"(415) 914-8923","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/54/16/111654_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Holly Oswald","title":"Psychologist","licenses":",","description":"\"I offer individual and family therapy for adults and adolescents, couples therapy, play therapy for children, and psychological testing for all ages. Using a mixture of cognitive, expressive, and reflective approaches, I help clients address a wide range of issues including anxiety, depression, grief, managing life transitions, behavioral problems, and relationship conflicts.  I have specialized experience helping clients with histories of trauma, neglect, and abuse, as well as those who have been diagnosed with chronic illnesses and pain disorders.\"","phone":"(415) 969-2073","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/11/60/266011-1141543-2_320x400.jpg?pu=1515034678","isVerified":"Verified by Psychology Today"},{"name":"Daniella Beznicki","title":"Marriage & Family Therapist","licenses":",","description":"\"Therapy can lead to better relationships and more ease in our lives.  I work with people to get in touch with the most authentic and real parts of themselves. Sometimes these parts get buried because of how we've felt hurt or misunderstood in life. Together we will get to know these hurt parts and how they show up, whether it is through fears and worries, the critical voice you hear inside, or a feeling of being stuck, lost, alone or helpless.\"","phone":"(415) 255-2650","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/14/28/202814-673420-3_320x400.jpg?pu=1468852223","isVerified":"Verified by Psychology Today"},{"name":"Donna Molettiere, Somatic Psychotherapy","licenses":"MA,","description":"\"I offer a safe, warm and clear environment where sensitive issues can be explored and tangible tools implemented for making positive changes.  Maybe you are experiencing challenges in relationships at home or at work, or you are holding yourself back based on issues from your family of origin.  Maybe you suffer from depression, anxiety, stress or you have yet to tap into what your heart truly desires with a sense of purpose and passion. I will help you discover new resources within yourself so you are empowered to live with more vitality and satisfaction in life.\"","phone":"(415) 390-2486","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/99/33/123399-1157304-2_320x400.jpg?pu=1517236833","isVerified":"Verified by Psychology Today"},{"name":"Judith Rubin LCSW","licenses":"LCSW","description":"\"I am a seasoned psychotherapist. My work is depth oriented and solution focused. Often grief prevents reaching for support.  A heart centered approach can allow the unfreezing and softening that makes therapy accessible. Regardless of the pain you are struggling through, meeting and talking together can determine weither we are a good fit. Contact me for a free consultation. We can trust our process, to find a direction forward.\"","phone":"(415) 915-6743","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/08/49/394908-1231936-2_320x400.jpg?pu=1527035860","isVerified":"Verified by Psychology Today"},{"name":"Leticia A Manzanares","title":"Marriage & Family Therapist","licenses":",","description":"\"Relationships are challenging and they bring a spectrum of emotions from happiness to heartache. Having a quiet place to deal with the adjustment of any major life transition can bring an experience of change and insight.  My goal is to create a safe, confidential and supported space for my client to do the necessary interpersonal work so they can bring the best of themselves to any relationship or life issue. I take a client-centered approach, which gives me the opportunity to invite the client to explore the process of personal growth.\"","phone":"(415) 697-3362","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/23/57/135723_6_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Dan Scharlack","title":"Marriage & Family Therapist","licenses":",","description":"\"What is it you most deeply want? I can help you find your natural strengths and let go of old beliefs and painful emotions that stand in the way of you loving the life you live.   Through a mindful and compassionate inquiry into places where you feel stuck, I help you to extinguish negative patterns and to recognize and express your true gifts in the world.  Many of my clients are artists and creative professionals. My specialties include helping you to have more fulfilling relationships, expand your creativity, overcome addictive patterns, develop your self-esteem, and experience greater personal growth.\"","phone":"(415) 704-8638","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/87/88/108887_7_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Vera Fleischer","title":"Marriage & Family Therapist","licenses":",","description":"\"As a psychotherapist working with shame, self-esteem and the inner critic, I like to focus more on making use of your choices when you uncover that you are already good enough and less on healing your so-called broken parts. I propose that being comfortable in your own skin, whether you are alone or with others, is more helpful than attaining a particular self-image.\"","phone":"(415) 723-1443","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/36/65/256536-893564-2_320x400.jpg?pu=1490298656","isVerified":"Verified by Psychology Today"},{"name":"Lily (Christian) Eggers","title":"Marriage & Family Therapist","licenses":",","description":"\"Please note that I'll be on Maternity leave July, 2017 - Spring, 2018.  Please reach out if you'd like to be contacted when I return. I have spent over 20 years exploring my own mind/body connection and personal potential through yoga, meditation, hypnosis, triathlon training, rock climbing, cycling, and fire walking. I created Yin Warrior Health, a program designed to heal our relationship with food and body image, and BodyAwake, a unique holistic fitness which heightens physical/emotional sensitivity.  I work best with people burdened with ineffectual patterns who know there is more to life than staying stuck!\"","phone":"(415) 767-1741","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/49/55/135549_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Lu Peyre","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"My role as a therapist is that of an empathetic co-pilot.  I work in a client-centered way,  and I will support you in creating healthy choices and new resources for yourself. My approach is compassionate, intuitive, and interactive.  I strive to meet each client's personality and goals in a safe and welcoming environment.  I am multilingual and multicultural. My various life experiences provide a base that will help me support you as we work together to meet your goals.\"","phone":"(415) 857-0013","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/64/67/296764-718030-2_320x400.jpg?pu=1472942426","isVerified":"Verified by Psychology Today"},{"name":"Rhea St. Julien","title":"Marriage & Family Therapist","licenses":",","description":"\"Please note: I am currently on Maternity Leave. Please contact me in September! You do not need to be perfect. You do not need to be alone with your imperfections. Whether you are a stressed out parent trying to \"have it all\", a couple that wants more than to look happy on Facebook, or an individual struggling with who you are supposed to be in this world, I can help you navigate your life in an empowering way. In a session with me, we will use the arts and creativity to go further than words, to create real, deep change.\"","phone":"(415) 858-6773","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/14/95/59514-333322-2_320x400.jpg?pu=1415905892","isVerified":"Verified by Psychology Today"},{"name":"Cheryl Leong","title":"Marriage & Family Therapist","licenses":",","description":"\"If you're looking for a balance of depth, empathy and pragmatism you may book an appointment for a complimentary phone consult here: http://cherylleonglmft.fullslate.com\"","phone":"(415) 598-4265","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/12/91/89112-686498-3_320x400.jpg?pu=1501105293","isVerified":"Verified by Psychology Today"},{"name":"Alexandra (Ali) Joy Sideroff","title":"Marriage & Family Therapist","licenses":",","description":"\"I support clients of diverse cultural backgrounds and ages in working through judgments so they can accept themselves and live with trust rather than shame and doubt. We may work through past traumas that have shaped the self or examine present issues from a solution-focused perspective to develop tools that can be applied to daily life.\"","phone":"(415) 799-8168","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/37/42/94237-1034042-2_320x400.jpg?pu=1503291664","isVerified":"Verified by Psychology Today"},{"name":"Marika Davis","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I'm curious about people: how our unique histories have shaped us, how we relate to each other, and what motivates our behavior. Working together, we have an opportunity to co-create a relationship that feels comfortable and supportive. I offer reflection and inquiry to help strengthen your ability to identify emotions, sensations, behavioral patterns and your truth. This awareness often connects to past experiences, further developing an understanding of yourself and your needs.\"","phone":"(415) 943-2389","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/05/45/364505-1115091-2_320x400.jpg?pu=1509857479","isVerified":"Verified by Psychology Today"},{"name":"Theresa Lucia Cangelosi","title":"Marriage & Family Therapist","licenses":",","description":"\"I treat individuals and couples of all ages.  As a somatic psychotherapist, I use a body-mind approach to help clients move through life's challenges in a natural, integrative and holistic way.  I specialize in education, prevention and resolution of trauma. At times we can feel stuck and confused, and need help coming back into balance in our bodies, minds and relationships.  A somatic approach focuses on the here and now and what is going on.  It is only when we are aware of what we are sensing in the present that we can make a boundary or choice.\"","phone":"(415) 236-2912","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/12/22/122212_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Jami Grich","title":"Psychologist","licenses":",","description":"\"Find Your Joy is the name of my practice and sums up what I believe the goal of therapy is. If you are searching for your joy, I can probably help you. Many people lost their joy (or never had it) due to anxiety, depression, stress, relationship problems, loneliness, emptiness, fear, trauma, chronic pain, addiction...or a combination of these things. My belief is that deep healing creates the space for love to enter and joy to return. I have 20 years of training in mind, body, spirit techniques to help you understand and overcome your problems & find your joy.\"","phone":"(415) 625-0045","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/51/03/190351-288604-3_320x400.jpg?pu=1401975361","isVerified":"Verified by Psychology Today"},{"name":"Vanessa Wolter","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I specialize in holistically treating social anxiety, sensitivity, relationship issues, low self-esteem, negative body image, panic, grief, depression, trauma, and existential/spiritual crisis. My mission is to help clients transform their pain into an opportunity for self-discovery, healing and empowerment, to ultimately reclaim their voice, purpose, and self-worth. I compassionately welcome individuals who feel silenced, disconnected from loved ones, overwhelmed, lost, or that they \"don't belong,\" as well as people who have experienced bullying, emotional or physical abuse, and those who don't feel comfortable in their body or struggle with a harsh inner critic.\"","phone":"(415) 237-9513","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/51/91/299151-795714-2_320x400.jpg?pu=1480949297","isVerified":"Verified by Psychology Today"},{"name":"Sally Payson Hays","title":"Psychologist","licenses":",","description":"\"My specialty is in helping support children and adolescents who struggle in school with learning differences and ADHD.  I provide thorough assessment as well as ongoing advocacy with public and private schools as well as individual therapy and family support to children, teens, and young adults.  I also provide education and information to groups of parents and educators who want to be more effective in supporting children succeed.  I use CBT and mindfulness practice to help children and parents communicate more succesfully, and to promote problem solving while improving relationships.  I provide assessment and advocacy packages to minimize costs.\"","phone":"(415) 704-8252","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/62/01/150162-468064-2_320x400.jpg?pu=1444080519","isVerified":"Verified by Psychology Today"},{"name":"Sebastian Melo","title":"Clinical Social Work/Therapist","licenses":",","description":"\"When facing life stressors and during difficult transitions, it is good to know that there are safe places where you can turn to for support and guidance. I am a bilingual (Spanish/English) licensed clinical social worker in San Francisco and have experience providing therapy with clients from diverse cultures.  Sexual orientations and gender identity have been a focus for some of my work. I believe that therapy is a useful tool to help you manage your life better and to build skills to reduce anxiety and depression, and to cultivate self-compassion.\"","phone":"(650) 620-7798","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/13/15/361513-1100810-3_320x400.jpg?pu=1508252874","isVerified":"Verified by Psychology Today"},{"name":"Jo Sopko","title":"Marriage & Family Therapist","licenses":",","description":"\"* ADULTS: I work with issues of loss, stress, anxiety,  depression, abuse, sex addiction, spiritual guidance, and developmental life changes.* CHILDREN:  I invite their stories that may be troubled due to emotional and academic issues. Through play, art and sand tray, I address issues of divorce, traumatic losses, abuse, adoption, bullying and low self esteem that may be affecting your children.                 * COUPLES: My passion is to help the couple find a yet unknown way to a compassionate, loving, open communicative relationship; to become vulnerable to the pain and wounds of each other's soul.\"","phone":"(415) 799-4143","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/45/51/135145_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Gargi Patel","title":"Marriage & Family Therapist","licenses":",","description":"\"Therapy is a unique opportunity to explore your truest self. It is a space with no right or wrong. I am available for you to discover and be with various parts of yourself. Together, we will explore these pieces and the experiences that cause pain and discomfort; through this, there will be space for healing, understanding, and acceptance. My goal as a therapist is to accompany you on your journey: To guide you in understanding your authentic self as you foster self-love and acceptance for all the parts of yourself.\"","phone":"(415) 390-0055","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/16/08/280816-583200-2_320x400.jpg?pu=1458246558","isVerified":"Verified by Psychology Today"},{"name":"Solid Ground Psychotherapy","licenses":"LMFT","description":"\"We naturally strive to make sense of the things that happen to us. With compassionate guidance and support, the effects of traumatic and impactful events can be transformed. My approach is collaborative, warm and interactive. My mindfulness-based, psychodynamic practice provides a safe haven from which to explore and create meaning of the key events of your life so that you can arrive at a place of balance and contentment.  The process of therapy can help you reclaim your equanimity, vitality and natural resilience.  I utilize sand tray and other creative means of expression to aid in the healing process.\"","phone":"(415) 477-1698 x2","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/97/24/302497-1067860-2_320x400.jpg?pu=1505770028","isVerified":"Verified by Psychology Today"},{"name":"Marissa Cotter","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I provide relational, trauma-informed somatic therapy for adults, kids & teens. I work in collaboration, with your mind, body, and soul with respectful non-judgement, warmth, and appropriate humor.  Integrative therapy works successfully to treat mentalhealth issues, emotional dysregulation, and compacted stress, and is great for kids/teens through art-therapy, body-awareness, and non-directive play.            Couples- Straight and Queer -  I provide relational, emotion-somatic therapy, providing safe space to navigate communication and trust, and repair rupture / betrayal. Psychotherapy, to me, is personal, political, & social. It takes courage, strength, and hope to live into who you really are.\"","phone":"(628) 888-6059","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/19/93/279319-705332-2_320x400.jpg?pu=1510169718","isVerified":"Verified by Psychology Today"},{"name":"Elizabeth Chavez","title":"Marriage & Family Therapist","licenses":",","description":"\"Hello, I have 15 years experience working as a clinician. I work with clients collaboratively, am empathic and non-judgmental and provide a safe space where you can work with a culturally sensitive therapist. I am fluent in Spanish; bilingual and bicultural. I have worked with children, teens, adults and families and have worked extensively with those impacted by violence and abuse as well as those dealing with trauma and other family issues. I provide bereavement and grief services to adults and children. I also have experience in providing psychosocial assessments for UVisa and political asylum applications as well as hardship assessments.\"","phone":"(628) 600-1726","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/44/62/276244-555741-1_320x400.jpg?pu=1455236912","isVerified":"Verified by Psychology Today"},{"name":"Juliet Osborne","title":"Marriage & Family Therapist","licenses":",","description":"\"Are you feeling stuck? Do you feel isolated? Are you consumed by anxiety or depression? If blocked parts of us remain unexpressed, we can become frozen, or overwhelmed by our feelings, and sometimes develop addictive or unhealthy behaviors, or patterns that impact our lives in harmful ways.  Sometimes we just need a safe space to share and unpack an issue and look at it from a different perspective. I work with individuals to identify areas of their lives where they feel emotionally blocked.\"","phone":"(415) 853-3931","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/87/21/392187-1220824-2_320x400.jpg?pu=1525661788","isVerified":"Verified by Psychology Today"},{"name":"Sonia Bello","title":"Marriage & Family Therapist","licenses":",","description":"\"I am a bilingual bicultural Marriage & Family Therapist in the field of mental health for over 7 years. In my practice, I strive to provide a safe, nurturing, and supportive environment for individuals to explore and grow in desired areas. I work from a strength based approach and I am passionate about empowering individuals and families reach their full potential.\"","phone":"(415) 234-1637","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/48/31/263148-479155-3_320x400.jpg?pu=1445370582","isVerified":"Verified by Psychology Today"},{"name":"Claudia E Rivas","title":"Clinical Social Work/Therapist","licenses":",","description":"\"My experience has been gained over the past 17 years while helping individuals and families during times of crisis, brought on by various stressors, mental health conditions and/or past or current trauma(s). I believe that together, we can explore barriers to achieving your goals, peace of mind and happiness.\"","phone":"(415) 969-3659","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/54/86/318654-1166909-2_320x400.jpg?pu=1518327598","isVerified":"Verified by Psychology Today"},{"name":"Enso Therapy Group","licenses":"LMFT","description":"\"Have you been feeling depressed, anxious, overwhelmed and alone? Do you find that your mind and emotions control you? Are you stuck in repetitive patterns? I work with people who are suffering with these symptoms and I have over 15 years of experience treating depression, addictions, anxiety and eating disorders. I have a background in art and have a warm, engaging (rather than silent) style of interacting. My experience includes work at 2 eating disorder centers, Mental Health Assessor for University of California, SF, teaching graduate psychology classes, crisis work for Mental Health Association of NYC and supervision of psychotherapy interns.\"","phone":"(415) 996-1399","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/26/47/64726-1123657-2_320x400.jpg?pu=1511285078","isVerified":"Verified by Psychology Today"},{"name":"Heidi Landgraf","title":"Counselor","licenses":",","description":"\"I work in tandem with neurofeedback and psychotherapy to recover your true resilience.  I can work in either modality alone, however the two together have a synergistic effect, producing quicker results. Neurofeedback assists in restoring optimal brain health, while psychotherapy can help you become aware of your thinking patterns, and assist you in creating better emotional balance. You can feel awake and deeply connected to the world and others around you again.  Whether you are struggling with addictions, depression, anxiety, ADD/ADHD, PTSD or other traumas, I can help free you from old blockages and restore your original, true nature.\"","phone":"(773) 863-3189","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/02/66/336602-928798-3_320x400.jpg?pu=1524175069","isVerified":"Verified by Psychology Today"},{"name":"Leopoldo F. Villela","title":"Psychologist","licenses":",","description":"\"The issues on spirituality, mental health and psychology are part of my practice and interests. The frames I use are Psychodynamic and Tibetan Buddhism.\"","phone":"(650) 530-0977","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/10/66/46610_7_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Diana Halfmann","title":"Marriage & Family Therapist","licenses":",","description":"\"I offer therapy for children & teens, parent-child relational therapy, family therapy, psychotherapy & shamanic counseling. Do you want to alleviate stress & anxiety? Would you like to feel more on track and content with your life path? Are you a parent wanting to lessen the power struggles with your child? I create a safe environment for children by empathic listening & using play/art materials to help decrease behavioral issues & increase their ability to express themselves more appropriately. Parent-child relational therapy is a psycho-educational tool that strengthens your relationship with your child for more harmonious interactions and transitions.\"","phone":"(415) 524-7921","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/64/93/99364-913884-3_320x400.jpg?pu=1492489545","isVerified":"Verified by Psychology Today"},{"name":"Julio Lagos","title":"Clinical Social Work/Therapist","licenses":",","description":"\"I offer an attentive and supportive environment for healthy, positive change. My practice focuses on a blend of Psychodynamic, Narrative, Motivational Interviewing and a Rational-Emotive Cognitive Behavioral Therapy (RE-CBT) approach, which means I focus on your thinking and attribution process, your emotions in regards to events and situations, your somatic body response and actions to events and experiences, and your relationship with self, others, and the roles you play in life. Establishing a secure connection with a therapist you feel comfortable with is essential in getting started.\"","phone":"(415) 749-9871","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/07/00/150007-204448-3_320x400.jpg?pu=1518879174","isVerified":"Verified by Psychology Today"},{"name":"Alison Livingston","title":"Marriage & Family Therapist","licenses":",","description":"\"I provide psychotherapy to adults, adolescents and children.  It can be a painful and brave decision to enter therapy and ask for help. I strive to build a reparative relationship with my clients to help them alleviate suffering and address barriers to having a meaningful life. My client's feel heard and less alone as they navigate life's challenges.\"","phone":"(415) 825-3308","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/03/61/236103-1161930-3_320x400.jpg?pu=1517842768","isVerified":"Verified by Psychology Today"},{"name":"Beth Hayes","title":"Marriage & Family Therapist","licenses":",","description":"\"Finding a therapist that you connect with can be a daunting task. Making connections is one of my strengths. I have the utmost respect for each person seeking therapy and for the therapeutic process itself.  Whether you are struggling, going through a transition, or looking to better understand your inner world our work can help you achieve new levels of awareness. My style is warm and non-judgmental.  We can work together to uncover and understand how your unique individual life experiences shape how you feel and live. Together we can strive to make meaning, increase awareness, and minimize suffering.\"","phone":"(415) 423-2344","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/27/03/170327-1180821-2_320x400.jpg?pu=1520125946","isVerified":"Verified by Psychology Today"},{"name":"Beth Jaeger-Skigen","title":"Clinical Social Work/Therapist","licenses":",","description":"\"Welcome. Searching for a therapist is a brave first step on the path to healing. If you find yourself not getting what you want out of work, relationships, and personal growth, therapy with me is an effective route to get what you want out of life. I am committed to helping people find more productive ways of overcoming obstacles and self-destructive patterns that interfere with living more satisfying lives. In addition to listening, I am interactive. Clients find me to be warm, empathic and easily approachable. I create a safe environment for my individuals clients, couples and groups.\"","phone":"(415) 320-7239","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/00/42/44200_6_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"M Catherine Costello","title":"Marriage & Family Therapist","description":"\"I help individuals and couples who want a safe place to tell their story and want to learn better ways to respond to the challenges in their life. Some of the issues I have worked with the most are trauma, work stress, anxiety, family squabbles, addictive behaviors, depression, creativity, and health challenges. While accessing inner strengths and support systems, it becomes easier to find the courage to delve a little deeper, heal some old wounds, and upgrade our behavior and coping skills. I welcome clients who are dealing with challenges related to age, ethnicity, gender, class, or sexual orientation.\"","phone":"(415) 528-5009","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/61/51/185161-263465-2_320x400.jpg?pu=1393555853","isVerified":"Verified by Psychology Today"},{"name":"Randi Myrseth","title":"Marriage & Family Therapist","licenses":",","description":"\"In the spirit of kindness and compassion we will sit together and explore the changes you are seeking and the habitual patterns and behaviors that may no longer serve you. I might help you to:  Discover and release emotional and relational wounds; Alleviate depression, hopelessness, anxiety or mood instability;  Face life transitions in employment, relationships, health or aging; Deal with loss and grief; Resolve issues with drug and alcohol dependence; Navigate parenting issues from infancy through young adulthood; Develop more satisfying communication and intimacy in relationships and deepen your relationship with yourself, emerging from dissatisfaction to find fulfillment.\"","phone":"(415) 871-0053","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/00/75/247500-405436-1_320x400.jpg?pu=1514937664","isVerified":"Verified by Psychology Today"},{"name":"Kaitlin Geenen","title":"Marriage & Family Therapist","licenses":",","description":"\"I specialize in the treatment of anxiety, depression, eating disorders and substance abuse. I incorporate evidence-based treatments with tangible practices clients can use in and outside of therapy. The modalities I use include Dialectical Behavioral Therapy, Cognitive Behavioral Therapy, psychodynamic therapy and mindfulness practices. I support individuals in 12-step recovery, (OA, AA, NA and Alanon)  as well as those seeking alternatives to abstinence such as a Harm Reduction model of support. I work with clients to understand and reduce their problematic behaviors while building awareness of the underlying issues at the root of the problems.\"","phone":"(415) 767-1467","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/40/31/193140-433021-3_320x400.jpg?pu=1503955443","isVerified":"Verified by Psychology Today"},{"name":"Peter P Bernhardt","licenses":"MFT","description":"\"Are your relationships burdened by loss of trust, constant fighting, or a feeling of disconnection? Are dealing with the fallout of an affair? Are you struggling with anger or communication issues? Do you you want relief from suffering, stress or isolation? My mindfulness approach, based on over 30 years experience, will help you get immediate relief through new perspectives and skills. By learning to see your problematic relationship patterns and negative cycles, you will also discover new pathways and new ways of relating. As you feel better, you will take steps to strengthen your new discoveries and abilities.\"","phone":"(510) 497-0537","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/93/21/62193_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Vanita Kunert","title":"Marriage & Family Therapist","licenses":",","description":"\"Warm greetings!  I appreciate the challenge of finding the \"right\" therapist for you. If you are worried about your job or relationship issues, i am glad you are here. My approach is interactive with a focus of  finding practical solutions for your concerns. If you are a couple who desires more intimacy and better ways to resolve differences, I can assist you in making new connections. Based on my 20 years of experience as the Manager of the EAP for PG&E, I offer counseling that addresses a wide range of workplace concerns including conflict with co-workers and bosses.\"","phone":"(415) 683-0611","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/74/57/315774-833208-3_320x400.jpg?pu=1484930017","isVerified":"Verified by Psychology Today"},{"name":"Anna H. McDonald","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I get it. You don't want to be dealing with this. You don't want to admit that you're going to need some help with this part of your life. And that's ok. Sometimes you can't outsmart what's happening, and you need a little extra. There is nothing wrong or bad about you because you made some mistakes, or are struggling with your mood or emotions. There is nothing wrong or bad about you because you need help figuring out your career, relationships, and life.\"","phone":"(415) 965-4848","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/77/00/290077-1223149-2_320x400.jpg?pu=1525902358","isVerified":"Verified by Psychology Today"},{"name":"James Lacroce","title":"Psychologist","licenses":",","description":"\"My role as a psychologist is to help you navigate through a complex and stressful world.  I'm most skilled at addressing issues related to depression and anxiety, relationship challenges, and self-esteem.  Additionally, I enjoy helping people manage social and behavioral problems prevent healthy interactions with family, friends, and co-workers.  I am experienced in addressing the challenges of both adults and children by drawing upon a few different theoretical perspectives to aid in helping individuals understand themselves, the origin of their problems, and how they can make changes in current life to feel happier.\"","phone":"(415) 938-5245","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/24/35/213524-323347-3_320x400.jpg?pu=1412871080","isVerified":"Verified by Psychology Today"},{"name":"Claudio Zanet","title":"Marriage & Family Therapist","licenses":",","description":"\"Are you making it through the day, looking to the rest of the world as if you're doing just fine, but deep down inside you feel stuck and uninspired? Do you wonder what is holding you back from thriving in the world? In our hectic world we often find ourselves afraid to take risks that could jeopardize the stable lives we've created for ourselves. We remain in jobs, relationships and old patterns that no longer work, while symptoms such as anxiety, depression, stress, anger and self-defeating patterns keep us from making real changes to our lives.\"","phone":"(415) 578-7307 x3","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/67/81/138167-781107-2_320x400.jpg?pu=1479159102","isVerified":"Verified by Psychology Today"},{"name":"Aimee Armata","title":"Marriage & Family Therapist","licenses":",","description":"\"I work from a relational, psychodynamic perspective integrating life enhancing and saving skill building focus as needed, particularly for adolescents and folks who would benefit from improved emotional regulation strategies to increase personal freedom, expand relational flexibility and improve well-being. I am an engaged and empathic clinician who will work with you to establish attunement in our relationship activating what you already are, know and have and bringing forth your language- to what might have only been spoken in symptoms, patterns that repeat, ways of being and relating that causes suffering.\"","phone":"(415) 944-1314","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/90/26/342690-1163869-2_320x400.jpg?pu=1517953181","isVerified":"Verified by Psychology Today"},{"name":"Karen Wolfe","title":"Marriage & Family Therapist","licenses":",","description":"\"Therapy with me is casual and warm, while providing you a space for direct guidance and embodied meditation practices to help you on your journey. I specialize in relationships and intimacy and support to improve communication, work through anxiety, and create a fulfilling life. I have offices San Francisco and Lafayette, CA. This holistic, embodiment-oriented psychotherapy offers individuals and couples concrete skills to tackle anxiety, depression, and relationship challenges in a safe and inviting space.\"","phone":"(415) 868-4515","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/10/42/374210-1147267-3_320x400.jpg?pu=1515801551","isVerified":"Verified by Psychology Today"},{"name":"Marvin Berkowitz","title":"Clinical Social Work/Therapist","licenses":",","description":"\"I'm a easy going, down-to-earth interactive clinician with 25+ years experience.  I came to psychotherapy after careers in academia,  the corporate world and government.  I was a single parent for many years.   I know about racial, cultural, religious, gender, and LGBT issues through my life, family or friends..  I've supervised other therapists..   I've worked with people with relationship problems, parenting, difficulties on the job, aging, moving, dealing with sickness or disabilities, care or death of loved ones, bad habits, just getting bogged down and feeling stuck, as well as serious physical and emotional issues.\"","phone":"(415) 849-4932","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/07/15/351507-1117075-2_320x400.jpg?pu=1510162945","isVerified":"Verified by Psychology Today"},{"name":"Paul Oglesby","title":"Marriage & Family Therapist","licenses":",","description":"\"If you've been feeling anxious, overwhelmed, depressed, or just maddeningly stuck; I congratulate you for taking the first step of seeking help. For 20 years I have provided effective, engaging, personalized psychotherapy to adults, couples, teens, children and families and have helped hundreds of individuals get back on track and on with their lives. I provide a safe environment, an empathetic ear, an open heart and a relaxed, conversational style of therapy. My clinical approach focuses on two important areas; relationships and personal development through the lifespan.\"","phone":"(650) 492-6789","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/98/80/98098_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Kyle Celio","title":"Marriage & Family Therapist","licenses":",","description":"\"Are things just not going quite right? Are parts of your life feeling out of your control? Do you need a safe and loving place to talk about what's really going on? I believe we all do sometimes and my goal is to provide this place for you so that you may share your story to someone who is warm, approachable and non-judgmental. Together let's look at what is and isn't working in your life right now in a calm and interactive way increasing your self-awareness and building upon the strengths you already have.\"","phone":"(415) 637-9699","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/27/86/58627-504828-2_320x400.jpg?pu=1448863860","isVerified":"Verified by Psychology Today"},{"name":"360 Relationship","licenses":"LMFT","description":"\"Couples and relationship counseling with us works. You will be deeply supported by experienced professionals who have developed a direct, progressive and research based approach to couples counseling and therapy.  Expect fundamental and positive changes in how you communicate and love. You will change your relationship and life. We make an impact so you can grow and change in relationship to yourself and others. Welcome to what is possible.\"","phone":"(415) 423-1381","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/94/20/312094-936616-2_320x400.jpg?pu=1494519089","isVerified":"Verified by Psychology Today"},{"name":"Trish (Trishanjit) Singh","title":"Psychologist","licenses":",","description":"\"Is your child having difficulty at school, with learning or being social? Is your child being called hyperactive, withdrawn, or distracted?  Is your child seem angry, sad, worried, or nervous? Do you wonder if your child might benefit from special education services? Or if they need therapy? Do you wonder if your child is functioning at a level that is comparable to children within their peer group?  Having a Psychological Assessment or Psycho-Ed Evaluation can help you learn how to help your child develop and grow in a safe manner and give your family answers to the above.\"","phone":"(415) 570-7417","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/17/95/179517-247186-2_320x400.jpg?pu=1388445771","isVerified":"Verified by Psychology Today"},{"name":"Jen Poole","title":"Marriage & Family Therapist","licenses":",","description":"\"Welcome to my practice. I am a heart-centered therapist who works collaboratively with you. This work supports you in finding the roots of self- limiting beliefs and relationship patterns, and provides tools and techniques for healing, which gives way to inner clarity and freedom. When you are connected to your inner wisdom and intelligence, your life becomes healthy and grounded, relationships are more intimate and loving, and quality of life becomes richer. I use a holistic body-heart-and soul approach with those who are committed to growth and healing.\"","phone":"(628) 227-5436","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/65/01/300165-1193353-1_320x400.jpg?pu=1522351356","isVerified":"Verified by Psychology Today"},{"name":"Joslyn Baxter","title":"Psychologist","licenses":",","description":"\"When we feel secure, we believe in ourself and others. However, it can be difficult to feel this because we carry barriers that stand in the way. A lack of safety, stress, and lasting effects of a painful past often leave us feeling misunderstood, unsure, and in pain. But, it is possible to discover the reasons behind such feelings, and how past and present day experiences are complicating life, causing confusion and pain, and holding us back.\"","phone":"(415) 625-9801","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/43/89/128943-275161-2_320x400.jpg?pu=1397435388","isVerified":"Verified by Psychology Today"},{"name":"Hannah Green Therapy","licenses":"LMFT","description":"\"I help my clients let go and enjoy life.\"","phone":"(415) 941-6522","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/35/93/199335-549969-3_320x400.jpg?pu=1475248967","isVerified":"Verified by Psychology Today"},{"name":"Braulio Garcia","title":"Clinical Social Work/Therapist","licenses":",","description":"\"Whether you are coping with depression, sexuality issues, struggling with chronic illness or addiction issues, or having problems in your relationships with others, I believe that therapy can help you find the solutions to move forward in your life. I believe that all individuals have the capacity to live their best life and can become 'unstuck' with the help of therapy.\nI work with adults, both younger and older, women and trans clients,  as well as with couples navigating problems in their relationships.\"","phone":"(415) 702-3696","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/76/64/96476-687888-2_320x400.jpg?pu=1470343401","isVerified":"Verified by Psychology Today"},{"name":"Jessica Y. Breland","title":"Psychologist","licenses":",","description":"\"Mental and physical health are inextricably linked. As a clinical psychologist specializing in behavioral medicine, I treat a range of problems that affect mood and health, including eating and weight disorders, depression, anxiety, and general life stress. I also help people tackle health behaviors, like smoking cessation and chronic illness self-management, in ways that maintain quality of life.\"","phone":"(628) 600-1820","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/22/89/278922-570571-2_320x400.jpg?pu=1456936911","isVerified":"Verified by Psychology Today"},{"name":"Nicole Rae Lippert","licenses":"ACSW","description":"\"I am a post master's graduate of the University of Southern California (USC). I work with adolescents and adults using a blend of psychodynamic and behavioral methods to help clients explore their internal subjective experiences to enrich their wellbeing, and work toward social-emotional goals.\"","phone":"(844) 293-6077","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/33/95/349533-1028284-2_320x400.jpg?pu=1502846170","isVerified":"Verified by Psychology Today"},{"name":"Lori Fink","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"My practice is focused on helping people be authentic in every aspect of their lives. If you feel there are areas in your life that are not authentic for you, where you want to make changes but don't know where to start, therapy can help.  I have a strong belief in the human spirit and resilience and that change is possible.  It is this belief that inspires the work I do with my clients.  No matter what is going on in your life, if you are breathing and alive, you have the capacity for change, even if it's just a change in perspective.\"","phone":"(415) 669-5850","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/44/07/270744-522135-3_320x400.jpg?pu=1451926076","isVerified":"Verified by Psychology Today"},{"name":"Michelle Smith","title":"Clinical Social Work/Therapist","licenses":",","description":"\"If you have found your way to my profile, you are someone who has identified a problem or a challenge that you're looking for support in addressing. This is an important first step, and I look forward to hearing from you.  I am a Licensed Clinical Social Worker with an office on the border of the Mission and Bernal Heights, near BART and the tech buses.   I work with adults around issues pertaining to depression, anxiety, job stress, pregnancy, and parenting. I look forward to working with you!  Please contact me at 415-742-2556 or michellesmiththerapy@gmail.com so we can begin.\"","phone":"(415) 335-7763","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/05/15/261505-484341-3_320x400.jpg?pu=1445973567","isVerified":"Verified by Psychology Today"},{"name":"Jen Plummer","title":"Psychologist","licenses":",","description":"\"Beginning psychotherapy can be both an exciting and sometimes, challenging process.  Each person is the \"expert\" on their own experience, but at times we need collaborative support in order to sort through our emotional lives.  We may feel stuck in our current ways of coping and desire to make a change, or we may have been urged by loved ones to seek help.  Therapy allows us to open up our minds in an environment of safety, leaving us free to explore new ways of thinking and being in the world.\"","phone":"(415) 340-6256","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/38/90/349038-1012068-2_320x400.jpg?pu=1501519153","isVerified":"Verified by Psychology Today"},{"name":"Dr. Dana Blu Cohen","title":"Psychologist","licenses":",","description":"\"Do you find yourself playing out the same self sabotaging patterns and feel frustrated to break them? Do you have trouble in your relationships, wanting connection yet often feeling lonely? Do you resort to drugs or alcohol and it feels like it's becoming a problem? In therapy we can break these painful patterns by giving you the tools to make more powerful choices to change your life. My goal is to help you cope with difficult feelings so they don't control you and to develop intra (internal) and inter (between) personal skills to gain control over your life.\"","phone":"(415) 763-6085","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/10/66/266610-714744-3_320x400.jpg?pu=1472624155","isVerified":"Verified by Psychology Today"},{"name":"Laura M. Goodspeed","title":"Marriage & Family Therapist","licenses":",","description":"\"I believe - and multiple studies have demonstrated - that the single most important predictor of a successful therapy experience is the quality of the relationship between therapist and client. Building a safe, nurturing relationship is where I excel. My style is warm and highly interactive, best suited for clients who prefer a therapist who feels very human, less \"medical model.\" I assist clients to explore their thought patterns and corresponding emotional reactions, and to identify unconscious assumptions they hold about themselves. I also provide practical tools for improving communication, and managing symptoms of anxiety, depression and grief.\"","phone":"(415) 801-0624","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/82/69/116982-1150156-2_320x400.jpg?pu=1516218326","isVerified":"Verified by Psychology Today"},{"name":"Stephanie Denton","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"Life can bring so many uncomfortable, challenging and painful experiences.  As well as beautiful, fulfilling and hopeful moments. It can be hard to process and integrate everything.  This can lead to feeling split, depressed, numb, and out of touch. Many of our painful experiences come from within relationship with others.  I offer a space where repairing those experiences is possible.  I will meet you where you are at and be a non-judgmental witness to your healing process.\"","phone":"(415) 843-2375","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/78/43/354378-1048220-2_320x400.jpg?pu=1504301542","isVerified":"Verified by Psychology Today"},{"name":"Emily Marinelli","title":"Marriage & Family Therapist","licenses":",","description":"\"Life challenges and transitions can be scary and overwhelming. Sometimes you need someone to support you through them. My therapeutic approach is as a guide, honoring your stories and experiences in the world. Our work together will be collaborative, holistic, somatic and integrative. Everyone is different and together we will discover and explore healing modalities that will work best for you.   With over 15 years of experience working in community mental health with diverse and traditionally marginalized communities, I offer a unique grounded perspective of the intersections of oppression and the impact it has on our mental health.\"","phone":"(415) 798-2767","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/35/73/247335-539889-2_320x400.jpg?pu=1453586099","isVerified":"Verified by Psychology Today"},{"name":"Melinda Frenkel","title":"Marriage & Family Therapist","licenses":",","description":"\"Choosing to begin psychotherapy opens yourself to the experience of self-discovery, reflection, and growth. This decision may feel exhilarating or scary, as self-work often requires courage and a willingness to examine aspects of life which may have gone unattended for some time.  But truly, beginning psychotherapy reflects an inner desire and commitment to enhance the parts of yourself and your life which are working well, and to explore, and ultimately make changes in the parts you would like to be different.\"","phone":"(415) 938-5311","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/60/31/213160-323432-3_320x400.jpg?pu=1503075751","isVerified":"Verified by Psychology Today"},{"name":"Jerrica Danhoff","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"Are you an individual who wants support with the challenges in their life? Do you criticize yourself? Do you struggle with using your voice and setting healthy boundaries? If you answered yes to any of these questions, I am here to help.Together we can explore what is holding you back from being your true, authentic self. Starting therapy can feel like stepping into the unknown, which is why I strive to create a relationship with you built upon safety and trust. I believe healing comes from the therapeutic relationship we create together.\"","phone":"(415) 329-5531","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/49/05/370549-1149736-2_320x400.jpg?pu=1516151283","isVerified":"Verified by Psychology Today"},{"name":"Jessica Urzua Jones","title":"Marriage & Family Therapist","licenses":",","description":"\"I am a bilingual/bicultural Marriage Family Therapist (born and raised in Chile) with 4 years of experience working with clients who are dealing with depression, anxiety, trauma, PTSD, relationship conflicts and/or family conflicts.\"","phone":"(415) 949-7265","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/78/32/363278-1111831-3_320x400.jpg?pu=1509383975","isVerified":"Verified by Psychology Today"},{"name":"Anne-Marie Basso","licenses":"MS,","description":"\"Are you experiencing stress in relationships? Perhaps you are struggling at work? Are you preoccupied with your past? Have you experienced your fair share of loss and want to work through the grief?  Through therapy sometimes what is painful at the start leads to a more fulfilled, free, and meaningful life.  You can begin to create meaningful changes; better relationships, more work satisfaction,  and self understanding. You can develop greater trust, self-confidence and healthy self-assertion.  I invite you to schedule a session.\"","phone":"(415) 639-9861","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/25/09/270925-1191777-2_320x400.jpg?pu=1521668857","isVerified":"Verified by Psychology Today"},{"name":"Mophead Femme Therapy","licenses":"MS,","description":"\"Bri specializes in working with self-identified femmes who strive to fully embody their sexuality, identity, and gender expression. Her work is body-positive, sex-positive, poly-positive, and encourages creativity. She believes that femmes have unique experiences within queer communities related to bi-stigmatization, femme invisibility, and misogyny. Bri is trauma-informed and has experience working with symptoms including but not limited to depression, anxiety, dissociation, hypervigilance, grief, insecurity, and self-doubt. She supports femmes who live loudly, take up space, and believe that doing so is a radical act of self-love.\"","phone":"(859) 904-5768","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/22/43/354322-1047736-2_320x400.jpg?pu=1504282487","isVerified":"Verified by Psychology Today"},{"name":"Eve Kupferman","title":"Psychologist","licenses":",","description":"\"I believe that therapy can help you feel more connected to yourself and those around you, freer to pursue your goals, and more alive.  My approach is to provide a warm supportive environment so you can feel comfortable and able to speak about whatever is distressing you.  I like to work collaboratively, exploring both the past and the present, to figure out what is preventing you from feeling more fulfilled.  Together, we will develop strategies to remove these obstacles.\"","phone":"(415) 894-0931","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/62/28/42862_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"CK Olivieri Blackmore","title":"Marriage & Family Therapist","licenses":",","description":"\"CK Olivieri Blackmore is a Licensed Marriage and Family Therapist who approaches life with warmth, compassion and creativity. CK specializes in relationship dynamics, mood disorders and developmental life transitions. She is particularly adept in issues pertaining to the queer community and their loved ones. CK works both behaviorally and spiritually to navigate the nuanced needs of her diverse clientele and the associated sexual and gendered concerns that arise. Drawing upon over a decade of experience in psychotherapy, education and research CK utilizes a broad array of interventions stemming from cognitive-behavioral (CBT) and dialectical-behavioral (DBT), Gestalt and systemic therapies.\"","phone":"(415) 496-5092","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/89/74/107489-888436-3_320x400.jpg?pu=1489849937","isVerified":"Verified by Psychology Today"},{"name":"Rich Robinson","title":"Marriage & Family Therapist","licenses":",","description":"\"I do a healing form called Guided Self Healing to support people in letting go of counterproductive issues and patterns. Most issues and illnesses are symptoms of something that was too much to handle at the time. Whenever there is something we can't integrate, there is an associated discomfort that is born in that moment. I guide people to drop into the discomfort and go to where it originated. There we have the most leverage for healing and transforming something that was once too much to handle. By processing unresolved experiences you can be free of the symptoms they cause.\"","phone":"(510) 694-0410","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/10/68/396810-1234596-2_320x400.jpg?pu=1527538883","isVerified":"Verified by Psychology Today"},{"name":"Debra Safren","title":"Psychologist","licenses":",","description":"\"Do you want to experience more happiness in your life?  Have you struggled with feelings of sadness or worry?  Are you getting in the way of your own success?  Don't let your potential go to waste.  Good psychotherapy can change your life for the better.  I have found that difficult issues can be healed with the right treatment and connection to a knowledgeable clinician. Please don't hesitate to contact me.\"","phone":"(510) 466-1179","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/99/09/100999_2_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Yvette Fama","title":"Associate Marriage and Family therapist","licenses":",","description":"\"My therapeutic style is somatic, empathetic and appropriately humorous. I believe in a holistic approach to therapy, incorporating and joining mind, body and soul. I use breath work to focus on expanding your capacity to feel emotions; use awareness of tension to identify behaviors; and manage physiological sensations that overwhelm you. I enjoy working with individuals, couples and families struggling with trust, communication and trauma issues. I believe somatic therapy is helpful in relieving anxiety and depression by becoming aware of what overwhelms you and leaves you feeling stuck in a cycle that you can't stop.\"","phone":"(650) 469-8241","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/73/86/298673-745206-2_320x400.jpg?pu=1475516575","isVerified":"Verified by Psychology Today"},{"name":"Catherine Rose","title":"Psychologist","licenses":",","description":"\"I have more than 20 years experience working with individuals and couples in short term and in longer term in depth psychotherapy.  My clients struggle with depression, anxiety, loneliness, relationship challenges, questions around life direction, life purpose, personal identity.  Often they report feeling \"stuck,\" frustrated in their creative expression or in their ability to change or move forward in their lives. I try to look at each individual's strengths (ask how we can build upon those), and also look at where a person is getting in his or her own way.\"","phone":"(415) 682-6192","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/54/38/143854_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Charis Khoury","title":"Marriage & Family Therapist","licenses":",","description":"\"Therapy provides a special opportunity to slow down and focus on what's most important, with caring guidance and support. I create a safe and nonjudgmental environment for you to explore the difficulties, heartaches, old wounds, stuck places, or celebrations of your life. This process involves listening to the wisdom of your body and emotions as well as your mind. Collaborating with you, I will support you to find your authentic expression of aliveness, to develop a more intimate relationship with yourself and to expand your capacity to satisfyingly connect with others.\"","phone":"(415) 697-3212","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/97/62/136297_4_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Rocio B Rodriguez","title":"Marriage & Family Therapist","licenses":",","description":"\"I am a licensed bilingual, bicultural therapist who has been working in the mental health field for over 16 years. I enjoy working with the person who is ready to take that first step to make change. I support them by promoting a safe space in order to begin the therapeutic work. I normally work with individuals and families with multiple siblings. Recently I have been working with couples coming to address relationship challenges: intimacy and infidelity, finances, gambling and addictions, co-parenting and blended families, domestic violence and child abuse, as well as other relationship challenges.\"","phone":"(415) 939-8461","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/85/90/249085-409498-2_320x400.jpg?pu=1436903916","isVerified":"Verified by Psychology Today"},{"name":"Liz Tong","title":"Marriage & Family Therapist","licenses":",","description":"\"My style of therapy is warm, attentive, & engaged. I believe we all need to be heard, understood & truly seen for who we are; for this is where a sense of self-trust can deepen & self-esteem can strengthen. One of my goals is to help you feel less burdened & less alone in your struggles and also provide coping strategies when you are feeling overwhelmed. I honor the uniqueness of each individual & work in a way that meets your current needs (whether you are moving through a crisis situation, having relationship issues, needing help managing anxiety & depression, or healing from trauma).\"","phone":"(415) 969-3459","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/24/05/80524_8_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Kasey Varga","title":"Marriage & Family Therapist","licenses":",","description":"\"Are you feeling heartbroken or utterly confused by a romantic relationship? Are you a parent who is endlessly stirred up by your child's behavior? I offer an opportunity to utilize heartbreak in service of growth and to begin to untangle the reality of your current relationships from the residue of your history. I challenge parents to set firm limits with warmth and to allow children the full expression of their feelings. In light of a great deal of training and personal experience I bring a deep respect for the unknown and a willingness to land in mystery.\"","phone":"(628) 227-5522","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn4.sussexdirectories.com/rms/rms_photos/sized/44/47/144744-603842-3_320x400.jpg?pu=1460679924","isVerified":"Verified by Psychology Today"},{"name":"Heidi Haddad","title":"Clinical Social Work/Therapist","licenses":",","description":"\"On any given day, we can be impacted by people or events, creating ripples in our lives.  But, the more deeply we connect with our own internal values and rhythms, the more solid our footing.  With perception, humor and compassion, I value giving you the opportunity to safely explore your inner stories, fears and dreams. My hope is that you will find the validation, support and perspective necessary to create the change you so desire.                                   I have extensive experience working with children, individuals and families with histories of trauma, facing difficult life transitions, such as creating and blending families, adoption, separation, divorce, death and loss.\"","phone":"(415) 577-0685","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn0.sussexdirectories.com/rms/rms_photos/sized/88/79/147988_3_120x150.jpg?pu=0","isVerified":"Verified by Psychology Today"},{"name":"Kate Leffel","title":"Marriage & Family Therapist Associate","licenses":",","description":"\"I believe beginning therapy takes courage, and I have the utmost respect for anyone taking that risk. I strive to create a warm space of total acceptance for where you are in your journey. For as long as I can remember, I've been interested in people's stories. It's not surprising that I ended up doing the work I do. As a therapist, I listen to a person and help make sense of both the struggles and the strengths. I help my clients to find meaning in their experience and to move forward to create new stories.\"","phone":"(415) 792-0157","city":"San Francisco","state":"California","zip":"94110","image":"https://cdn2.sussexdirectories.com/rms/rms_photos/sized/77/96/299677-693148-2_320x400.jpg?pu=1470935273","isVerified":"Verified by Psychology Today"}]